#include <iostream>
#include <windows.h>
#include <conio.h>
#include <string>
using namespace std;
#pragma hdrstop
#pragma argsused

#ifdef _WIN32
#include <tchar.h>
#else
  typedef char _TCHAR;
  #define _tmain main
#endif

#include <stdio.h>

int _tmain(int argc, _TCHAR* argv[])
{
	SetConsoleOutputCP(1251);

//--------------- Синтаксис структурованого оператора for ---------------------------------
	for (int i = 0; i <= 255; i++) {
	  cout << (char)i;  // в циклі здійснюється перетворення змінної i, що приймає значення від 0 до 255 з кроком в 1, у символьний тип
					  // таким чином виводиться в консоль таблиця симвоолів, де кожен символ кодується однобайтовим значенням
	}
//-----------------------------------------------------------------------------------------

//--------------- Синтаксис структурованого оператора while ---------------------------------
	
//-----------------------------------------------------------------------------------------

//--------------- Синтаксис структурованого оператора do while ---------------------------------
	cout << endl << endl << "Виведення коду заданого символу";
	char symbol; // змінна, що буде зберігати введенний для перетворення символ
	bool flag = false; // змінна, що визначає чи буте повторюватися цикл ще раз
	do {
		cout<< endl << "Введіть символ для визначення коду: ";
		cin >> symbol;
		cout << "Код символу " << symbol << "дорівнює " << (int)symbol;
		cout << endl << "Чи бажаєте повторити? Введіть 1 або 0: ";
		cin >> flag;
	}
	while (flag);


//-----------------------------------------------------------------------------------------
	getch();
	return 0;
}
